# aipsy-analytics
Analytics repository

# Цель:
- собеседник, поддерживающий беседу.
- заключает контракт (на старте один из выбранных): исследовать сценарии жизни, разбор ситуации, поддержка. +озвучивает диклаймер проекта: You can use this at your own risk. 
- говорит голосом психолога (фрейд? перлз? нифонт? опра?)
- оцениванет собеседника по его рассказу
- умеет задавать уточняющие вопросы 
- избегает тем смерти и насилия, отправляет к людям. public psydb?
- мультиязычный (но как учесть локальные приколы?)


# Архитектура:
Аналог чатгпт, дообученный на записях клиентских сессий (где взять датасет?). Отдельный алгоритм отслеживает метрики. Исходя из метрик отвечает вместо чатгпт: "расскажи подробнее про...", "я думаю..." и т.п. 
Прототип: слушает речь собеседника, обрабатывает, отдает чатгпт для ответа с инструкцией "я психолог и тебе нужно иногда отвечать вместо меня клиенту. Частично я буду отвечать клиенту сам.  Когда мне потребуется чтобы ты ответил вместо меня, я буду присылать свой диалог с клиентом". Заводит временный профайл клиента, записывая туда метрики. Исходя из алгоритмов может отвечать сам, используя запросы. Когда алгоритмы не выдают запрос, то ответ переадресуется чатгпт с перечислением текста беседы.


# Реализация:
- достать датасет клиентских сессий
- достать аналог гпт, с возможностью добучения
- найти компетению дообучения
- найти компетенцию разворачивания среды
- написание метрик, отслеживаемых aipsy

